MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/inc/hc32f46x_timera.h
    /**
     *******************************************************************************
     ** \brief Timera hardware startup config structure definition
     **
     ** \note _<t>_ is unit number,range 1~6
     ** \note TMRA_HTSSR0 trigger startup only when unit 2~6 valid,unit 1 is invalid
     ******************************************************************************/
    typedef struct stc_timera_hw_startup_cofig
    {
        en_functional_state_t enTrigRisingStartupEn;   ///< Hardware startup TIMA_<t> when TIMA_<t>_TRIG sample rising edge(sync start valid)
        en_functional_state_t enTrigFallingStartupEn;  ///< Hardware startup TIMA_<t> when TIMA_<t>_TRIG sample falling edge(sync start valid)
        en_functional_state_t enSpecifyEventStartupEn; ///< Hardware startup TIMA_<t> when TIMA_HTSSR0 register Specify event trigger
    } stc_timera_hw_startup_cofig_t;

    /**
     *******************************************************************************
     ** \brief Timera hardware stop config structure definition
     **
     ** \note _<t>_ is unit number,range 1~6
     ******************************************************************************/
    typedef struct stc_timera_hw_stop_cofig
    {
        en_functional_state_t enTrigRisingStopEn;   ///< Hardware stop TIMA_<t> when TIMA_<t>_TRIG sample rising edge
        en_functional_state_t enTrigFallingStopEn;  ///< Hardware stop TIMA_<t> when TIMA_<t>_TRIG sample falling edge
        en_functional_state_t enSpecifyEventStopEn; ///< Hardware stop TIMA_<t> when TIMA_HTSSR0 register Specify event trigger
    } stc_timera_hw_stop_cofig_t;

    /**
     *******************************************************************************
     ** \brief Timera hardware clear config structure definition
     **
     ** \note _<t>_ is unit number,range 1~6
     ** \note n=2��4��6 when m=1��3��5 or n=1��3��5 when m=2��4��6
     ******************************************************************************/
    typedef struct stc_timera_hw_clear_config
    {
        en_functional_state_t enTrigRisingClearEn;             ///< Hardware clear TIMA_<t> when TIMA_<t>_TRIG sample rising edge
        en_functional_state_t enTrigFallingClearEn;            ///< Hardware clear TIMA_<t> when TIMA_<t>_TRIG sample falling edge
        en_functional_state_t enSpecifyEventClearEn;           ///< Hardware clear TIMA_<t> when TIMA_HTSSR0 register Specify event trigger
        en_functional_state_t enAnotherUnitTrigRisingClearEn;  ///< Hardware clear TIMA_<t> when unit n TRIG port sample rising when current unit is m.
        en_functional_state_t enAnotherUnitTrigFallingClearEn; ///< Hardware clear TIMA_<t> when unit n TRIG port sample falling when current unit is m.
        en_functional_state_t enChannel3RisingClearEn;         ///< Hardware clear TIMA_<t> when TIMA_<t>_PWM3 sample rising edge
        en_functional_state_t enChannel3FallingClearEn;        ///< Hardware clear TIMA_<t> when TIMA_<t>_PWM3 sample falling edge
    } stc_timera_hw_clear_config_t;

    /**
     *******************************************************************************
     ** \brief Timera hardware trigger init structure definition
     ******************************************************************************/
    typedef struct stc_timera_hw_trigger_init
    {
        stc_timera_hw_startup_cofig_t stcHwStartup; ///< Hardware startup condition config
        stc_timera_hw_stop_cofig_t stcHwStop;       ///< Hardware stop condition config
        stc_timera_hw_clear_config_t stcHwClear;    ///< Hardware clear condition config
    } stc_timera_hw_trigger_init_t;

    /*******************************************************************************
     * Global pre-processor symbols/macros ('#define')
     ******************************************************************************/

    /*******************************************************************************
     * Global variable definitions ('extern')
     ******************************************************************************/

    /*******************************************************************************
      Global function prototypes (definition in C source)
     ******************************************************************************/
    /* Base functions */
    en_result_t TIMERA_DeInit(M4_TMRA_TypeDef *TIMERAx);
    en_result_t TIMERA_BaseInit(M4_TMRA_TypeDef *TIMERAx, const stc_timera_base_init_t *pstcBaseInit);
    en_result_t TIMERA_SetCurrCount(M4_TMRA_TypeDef *TIMERAx, uint16_t u16Cnt);
    uint16_t TIMERA_GetCurrCount(M4_TMRA_TypeDef *TIMERAx);
    en_result_t TIMERA_SetPeriodValue(M4_TMRA_TypeDef *TIMERAx, uint16_t u16Period);
    uint16_t TIMERA_GetPeriodValue(M4_TMRA_TypeDef *TIMERAx);
    en_result_t TIMERA_SyncStartupCmd(M4_TMRA_TypeDef *TIMERAx, en_functional_state_t enNewSta);
    en_result_t TIMERA_Cmd(M4_TMRA_TypeDef *TIMERAx, en_functional_state_t enNewSta);

    /* Compare output functions */
    en_result_t TIMERA_CompareInit(M4_TMRA_TypeDef *TIMERAx, en_timera_channel_t enChannel,
                                   const stc_timera_compare_init_t *pstcCompareInit);
    en_result_t TIMERA_SetCompareValue(M4_TMRA_TypeDef *TIMERAx, en_timera_channel_t enChannel,
                                       uint16_t u16CompareVal);
    uint16_t TIMERA_GetCompareValue(M4_TMRA_TypeDef *TIMERAx, en_timera_channel_t enChannel);
    en_result_t TIMERA_SetCacheValue(M4_TMRA_TypeDef *TIMERAx, en_timera_channel_t enChannel,
                                     uint16_t u16CompareCache);
    en_result_t TIMERA_CompareCacheCmd(M4_TMRA_TypeDef *TIMERAx, en_timera_channel_t enChannel,
                                       en_functional_state_t enNewSta);
    en_result_t TIMERA_SpecifyOutputSta(M4_TMRA_TypeDef *TIMERAx, en_timera_channel_t enChannel,
                                        en_timera_specify_output_t enOutputSta);
    en_result_t TIMERA_CompareCmd(M4_TMRA_TypeDef *TIMERAx, en_timera_channel_t enChannel,
                                  en_functional_state_t enNewSta);

    /* Capture input functions */
    en_result_t TIMERA_CaptureInit(M4_TMRA_TypeDef *TIMERAx, en_timera_channel_t enChannel,
                                   const stc_timera_capture_init_t *pstcCapInit);
    en_result_t TIMERA_CaptureFilterCmd(M4_TMRA_TypeDef *TIMERAx, en_timera_filter_source_t enFilterPort,
                                        en_functional_state_t enNewSta);
    uint16_t TIMERA_GetCaptureValue(M4_TMRA_TypeDef *TIMERAx, en_timera_channel_t enChannel);

    /* Orthogonal coding functions */
    en_result_t TIMERA_OrthogonalCodingInit(M4_TMRA_TypeDef *TIMERAx, const stc_timera_orthogonal_coding_init_t *pstcCodingInit);
    en_result_t TIMERA_SetOrthogonalCodingCount(M4_TMRA_TypeDef *TIMERAx, uint16_t u16CodingCnt);
    uint16_t TIMERA_GetOrthogonalCodingCount(M4_TMRA_TypeDef *TIMERAx);
    en_result_t TIMERA_OrthogonalCodingFilterCmd(M4_TMRA_TypeDef *TIMERAx, en_timera_filter_source_t enFilterPort,
                                                 en_functional_state_t enNewSta);

    /* Hardware control functions */
    en_result_t TIMERA_HwTriggerInit(M4_TMRA_TypeDef *TIMERAx, const stc_timera_hw_trigger_init_t *pstcHwTriggerInit);
    en_result_t TIMERA_HwStartupConfig(M4_TMRA_TypeDef *TIMERAx, const stc_timera_hw_startup_cofig_t *pstcHwStartup);
    en_result_t TIMERA_HwStopConfig(M4_TMRA_TypeDef *TIMERAx, const stc_timera_hw_stop_cofig_t *pstcHwStop);
    en_result_t TIMERA_HwClearConfig(M4_TMRA_TypeDef *TIMERAx, const stc_timera_hw_clear_config_t *pstcHwClear);

    /* interrupt and flags functions */
    en_result_t TIMERA_IrqCmd(M4_TMRA_TypeDef *TIMERAx, en_timera_irq_type_t enIrq,
                              en_functional_state_t enNewSta);
    en_flag_status_t TIMERA_GetFlag(M4_TMRA_TypeDef *TIMERAx, en_timera_flag_type_t enFlag);
    en_result_t TIMERA_ClearFlag(M4_TMRA_TypeDef *TIMERAx, en_timera_flag_type_t enFlag);

    /* Event config functions */
    en_result_t TIMERA_EventCmd(M4_TMRA_TypeDef *TIMERAx, en_timera_channel_t enChannel,
                                en_functional_state_t enNewSta);
    en_result_t TIMERA_SetCountTriggerSrc(en_event_src_t enTriggerSrc);
    en_result_t TIMERA_SetCaptureTriggerSrc(en_event_src_t enTriggerSrc);

    //@} // TimeraGroup

#ifdef __cplusplus
}
#endif

#endif /* DDL_TIMERA_ENABLE */

#endif /* __HC32F46x_TIMERA_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
